In [28]:
import pandas as pd
import numpy as np
df = pd.read_csv("tips.csv")

In [3]:
df.shape

(244, 7)

In [6]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
dg = df.groupby('day')

In [8]:
type(dg)

pandas.core.groupby.groupby.DataFrameGroupBy

In [10]:
dg['tip'].sum()

day
Fri      51.96
Sat     260.40
Sun     247.39
Thur    171.83
Name: tip, dtype: float64

In [14]:
dg[['total_bill','tip']].aggregate(['sum','mean'])

     total_bill                tip
            sum       mean     sum      mean
day
Fri      325.88  17.151579   51.96  2.734737
Sat     1778.40  20.441379  260.40  2.993103
Sun     1627.16  21.410000  247.39  3.255132
Thur    1096.33  17.682742  171.83  2.771452

In [18]:
for (day,rows) in  dg:
    print(day)
    print(rows[rows['tip'] > 3])

Fri
     total_bill   tip     sex smoker  day    time  size
91        22.49  3.50    Male     No  Fri  Dinner     2
93        16.32  4.30  Female    Yes  Fri  Dinner     2
94        22.75  3.25  Female     No  Fri  Dinner     2
95        40.17  4.73    Male    Yes  Fri  Dinner     4
96        27.28  4.00    Male    Yes  Fri  Dinner     2
221       13.42  3.48  Female    Yes  Fri   Lunch     2
Sat
     total_bill    tip     sex smoker  day    time  size
19        20.65   3.35    Male     No  Sat  Dinner     3
20        17.92   4.08    Male     No  Sat  Dinner     2
23        39.42   7.58    Male     No  Sat  Dinner     4
24        19.82   3.18    Male     No  Sat  Dinner     2
28        21.70   4.30    Male     No  Sat  Dinner     2
34        17.78   3.27    Male     No  Sat  Dinner     2
35        24.06   3.60    Male     No  Sat  Dinner     3
37        16.93   3.07  Female     No  Sat  Dinner     3
39        31.27   5.00    Male     No  Sat  Dinner     3
59        48.27   6.73    Male     No  Sat  Dinner     4
60        20.29   3.21    Male    Yes  Sat  Dinner     2
63        18.29   3.76    Male    Yes  Sat  Dinner     4
65        20.08   3.15    Male     No  Sat  Dinner     3
72        26.86   3.14  Female    Yes  Sat  Dinner     2
73        25.28   5.00  Female    Yes  Sat  Dinner     2
76        17.92   3.08    Male    Yes  Sat  Dinner     2
103       22.42   3.48  Female    Yes  Sat  Dinner     2
104       20.92   4.08  Female     No  Sat  Dinner     2
106       20.49   4.06    Male    Yes  Sat  Dinner     2
107       25.21   4.29    Male    Yes  Sat  Dinner     2
108       18.24   3.76    Male     No  Sat  Dinner     2
109       14.31   4.00  Female    Yes  Sat  Dinner     2
170       50.81  10.00    Male    Yes  Sat  Dinner     3
171       15.81   3.16    Male    Yes  Sat  Dinner     2
206       26.59   3.41    Male    Yes  Sat  Dinner     3
211       25.89   5.16    Male    Yes  Sat  Dinner     4
212       48.33   9.00    Male     No  Sat  Dinner     4
214       28.17   6.50  Female    Yes  Sat  Dinner     3
219       30.14   3.09  Female    Yes  Sat  Dinner     4
232       11.61   3.39    Male     No  Sat  Dinner     2
238       35.83   4.67  Female     No  Sat  Dinner     3
239       29.03   5.92    Male     No  Sat  Dinner     3
Sun
     total_bill   tip     sex smoker  day    time  size
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
5         25.29  4.71    Male     No  Sun  Dinner     4
7         26.88  3.12    Male     No  Sun  Dinner     4
9         14.78  3.23    Male     No  Sun  Dinner     2
11        35.26  5.00  Female     No  Sun  Dinner     4
14        14.83  3.02  Female     No  Sun  Dinner     2
15        21.58  3.92    Male     No  Sun  Dinner     2
17        16.29  3.71    Male     No  Sun  Dinner     3
18        16.97  3.50  Female     No  Sun  Dinner     3
42        13.94  3.06    Male     No  Sun  Dinner     2
44        30.40  5.60    Male     No  Sun  Dinner     4
46        22.23  5.00    Male     No  Sun  Dinner     2
47        32.40  6.00    Male     No  Sun  Dinner     4
52        34.81  5.20  Female     No  Sun  Dinner     4
54        25.56  4.34    Male     No  Sun  Dinner     4
55        19.49  3.51    Male     No  Sun  Dinner     2
112       38.07  4.00    Male     No  Sun  Dinner     3
114       25.71  4.00  Female     No  Sun  Dinner     3
115       17.31  3.50  Female     No  Sun  Dinner     2
116       29.93  5.07    Male     No  Sun  Dinner     4
155       29.85  5.14  Female     No  Sun  Dinner     5
156       48.17  5.00    Male     No  Sun  Dinner     6
157       25.00  3.75  Female     No  Sun  Dinner     4
160       21.50  3.50    Male     No  Sun  Dinner     4
165       24.52  3.48    Male     No  Sun  Dinner     3
167       31.71  4.50    Male     No  Sun  Dinner     4
172        7.25  5.15    Male    Yes  Sun  Dinner     2
173       31.85  3.18    Male    Yes  Sun  Dinner     2
174       16.82  4.00    Male    Yes  Sun  Dinner     2
175       32.90  3.11    Male    Yes  Sun  Dinner     2
178        9.60  4.00  Female    Yes  Sun  Dinner     2
179       34.63  3.55    Male    Yes  Sun  Dinner     2
180       34.65  3.68    Male    Yes  Sun  Dinner     4
181       23.33  5.65    Male    Yes  Sun  Dinner     2
182       45.35  3.50    Male    Yes  Sun  Dinner     3
183       23.17  6.50    Male    Yes  Sun  Dinner     4
185       20.69  5.00    Male     No  Sun  Dinner     5
186       20.90  3.50  Female    Yes  Sun  Dinner     3
188       18.15  3.50  Female    Yes  Sun  Dinner     3
189       23.10  4.00    Male    Yes  Sun  Dinner     3
Thur
     total_bill   tip     sex smoker   day   time  size
77        27.20  4.00    Male     No  Thur  Lunch     4
81        16.66  3.40    Male     No  Thur  Lunch     2
83        32.68  5.00    Male    Yes  Thur  Lunch     2
85        34.83  5.17  Female     No  Thur  Lunch     4
87        18.28  4.00    Male     No  Thur  Lunch     2
88        24.71  5.85    Male     No  Thur  Lunch     2
125       29.80  4.20  Female     No  Thur  Lunch     6
134       18.26  3.25  Female     No  Thur  Lunch     2
140       17.47  3.50  Female     No  Thur  Lunch     2
141       34.30  6.70    Male     No  Thur  Lunch     6
142       41.19  5.00    Male     No  Thur  Lunch     5
143       27.05  5.00  Female     No  Thur  Lunch     6
191       19.81  4.19  Female    Yes  Thur  Lunch     2
194       16.58  4.00    Male    Yes  Thur  Lunch     2
197       43.11  5.00  Female    Yes  Thur  Lunch     4
200       18.71  4.00    Male    Yes  Thur  Lunch     3
204       20.53  4.00    Male    Yes  Thur  Lunch     4
205       16.47  3.23  Female    Yes  Thur  Lunch     3

In [20]:
tb = df.groupby('day')['total_bill'].sum()

In [22]:
tb

day
Fri      325.88
Sat     1778.40
Sun     1627.16
Thur    1096.33
Name: total_bill, dtype: float64

In [23]:
type(tb)

pandas.core.series.Series

In [24]:
tb['Sun']

1627.1600000000003

In [30]:
df.pivot_table(index='day', columns='size', values='tip',aggfunc=np.sum)

size     1       2      3      4      5     6
day
Fri   1.92   42.31   3.00   4.73    NaN   NaN
Sat   2.00  133.43  68.36  53.61   3.00   NaN
Sun    NaN  109.86  46.81  73.58  12.14   5.0
Thur  1.83  117.24  10.77  21.09   5.00  15.9

In [32]:
df.pivot_table(index=['day','sex'], columns='size', values='tip',aggfunc=[np.mean,np.sum])

             mean                                            sum         \
size            1         2         3         4     5    6     1      2
day  sex
Fri  Female   NaN  2.753750  3.000000       NaN   NaN  NaN   NaN  22.03
     Male    1.92  2.535000       NaN  4.730000   NaN  NaN  1.92  20.28
Sat  Female  1.00  2.693158  3.948000  2.770000   NaN  NaN  2.00  51.17
     Male     NaN  2.419412  3.740000  4.370000  3.00  NaN   NaN  82.26
Sun  Female   NaN  2.820000  3.028333  4.390000  5.14  NaN   NaN  19.74
     Male     NaN  2.816250  3.182222  4.001429  3.50  5.0   NaN  90.12
Thur Female  1.83  2.237917  2.295000  4.363333   NaN  4.6  1.83  53.71
     Male     NaN  2.647083  3.090000  4.000000  5.00  6.7   NaN  63.53


size             3      4     5    6
day  sex
Fri  Female   3.00    NaN   NaN  NaN
     Male      NaN   4.73   NaN  NaN
Sat  Female  19.74   5.54   NaN  NaN
     Male    48.62  48.07  3.00  NaN
Sun  Female  18.17  17.56  5.14  NaN
     Male    28.64  56.02  7.00  5.0
Thur Female   4.59  13.09   NaN  9.2
     Male     6.18   8.00  5.00  6.7